Repository: thlabbe/sicp-fr
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: It can be taken as a model that determines the ``meaning'' of procedure application, insofar as the procedures in this chapter are concerned.
fr_fr: Il peut être considéré comme un modèle qui détermine la « signification » de l'application de procédure dans le cadre des procédures de ce chapitre.

source: It is called cond (which stands for ``conditional''), and it is used as follows:
fr_fr: Cette forme se nomme cond (pour « condition ») et elle et utilisée de la manière suivante :

source: It is we humans who get confused by still relatively simple expressions such as
fr_fr: Ce sont nous, les humains, qui sont perplexes face à une expression relativement simple du type

source: It should be clear that the possibility of associating values with symbols and later retrieving them means that the interpreter must maintain some sort of memory that keeps track of the name-object pairs.
fr_fr: Il est clair que la possibilité d'associer des valeurs à des symboles puis de les retrouver par la suite signifie que l'interpréteur doit entretenir une mémoire qui enregistre les paires nom-objet.

source: Lisp uses applicative-order evaluation, partly because of the additional efficiency obtained from avoiding multiple evaluations of expressions such as those illustrated with (+ 5 1) and (* 5 2) above and, more significantly, because normal-order evaluation becomes much more complicated to deal with when we leave the realm of procedures that can be modeled by substitution.
fr_fr: Lisp utilise l'évaluation en ordre d'application en partie à cause de l'efficacité supplémentaire obtenue en évitant les évaluations multiples d'expressions telles que celles illustrées avec (+ 5 1) et (* 5 2) ci-dessus, et surtout car l'évaluation en ordre normal devient bien plus compliquée à pratiquer quand on quitte le domaine des procédures qui peuvent être modélisées par substitution.

source: Nesting of combinations provides a means of combining operations.
fr_fr: L'emboitement de combinaisons offre une manière de combiner les opérations.

source: New York St. Louis San Francisco Montreal Toronto
fr_fr: New York St. Louis San Francisco Montréal Toronto

source: Next, observe that the repeated application of the first step brings us to the point where we need to evaluate, not combinations, but primitive expressions such as numerals, built-in operators, or other names.
fr_fr: Ensuite, il faut comprendre que l'application répétée de la première étape nous amène au point où nous devons évaluer non pas des combinaisons mais des expressions primitives telles que des numéraux, des opérateurs *** et d'autres noms.

source: No ambiguity can arise, because the operator is always the leftmost element and the entire combination is delimited by the parentheses.
fr_fr: Il n'y a aucune ambiguïté car l'opérateur est l'élément le plus à gauche et la combinaison entière est délimitée par des parenthèses.

source: Notice how succinctly the idea of recursion can be used to express what, in the case of a deeply nested combination, would otherwise be viewed as a rather complicated process.
fr_fr: Remarquez la manière succincte avec laquelle l'idée de récursion peut être utilisée pour exprimer ce qui, dans le cas de combinaisons profondément emboitées, serait considéré comme un processus plutôt complexe.

source: Notice that and and or are special forms, not procedures, because the subexpressions are not necessarily all evaluated.
fr_fr: Remarquez que and et or sont des formes spéciales, pas des procédures, car leurs sous-expressions ne sont pas nécessairement toutes évaluées.

source: Notice that the evaluation rule given above does not handle definitions.
fr_fr: Remarquez que la règle d'évaluation ci-dessus ne prend pas en compte les définitions.

source: Now (+ 5 1) produces 6 and (* 5 2) produces 10, so we must apply the sum-of-squares procedure to 6 and 10.
fr_fr: (+ 5 1) vaut 6 et (* 5 2) vaut 10. Nous devons donc appliquer la procédure somme-de-carrés à 6 et 10.

source: Now we can use sum-of-squares as a building block in constructing further procedures:
fr_fr: Nous pouvons utiliser somme-de-carrés comme bloc pour construire d'autres procédures :

source: Now we will learn about procedure definitions, a much more powerful abstraction technique by which a compound operation can be given a name and then referred to as a unit.
fr_fr: Nous allons maintenant voir les définitions de procédures, une technique d'abstraction bien plus puissante avec laquelle on peut nommer une opération composée puis faire référence à celle-ci en tant que tout.

source: Numbers and arithmetic operations are primitive data and procedures.
fr_fr: Les nombres et les opérations arithmétiques sont respectivement des données et procédures primitives.

source: Observe in particular that it is not necessary to explicitly instruct the interpreter to print the value of the expression.7
fr_fr: On observera qu'il n'est pas nécessaire de demander explicitement à l'interpréteur d'afficher la valeur de l'expression.7

source: On the other hand, normal-order evaluation can be an extremely valuable tool, and we will investigate some of its implications in chapters 3 and 4.16
fr_fr: Cependant, l'évaluation en ordre normal peut être un outil précieux et nous étudierons certaines de ses implications dans les chapitres 3 et 4.16

source: One easy way to get started at programming is to examine some typical interactions with an interpreter for the Scheme dialect of Lisp.
fr_fr: Une manière facile de commencer la programmation est d'examiner des interactions à l'aide d'un interpréteur pour le dialecte de Lisp qu'est Scheme.

source: One kind of primitive expression you might type is a number.
fr_fr: Un type d'expression primitive qu'il est possible de saisir est un nombre.

source: One of our goals in this chapter is to isolate issues about thinking procedurally.
fr_fr: Un de nos objectifs dans ce chapitre est d'isoler les questions relatives à la pensée procédurale.

source: One of them is that it can accommodate procedures that may take an arbitrary number of arguments, as in the following examples:
fr_fr: L'un d'entre eux est de s'accommoder de procédures qui ont un nombre quelconque d'arguments comme dans les exemples suivants :

source: Otherwise it evaluates the <alternative> and returns its value.19
fr_fr: Autrement il évalue l'<alternative> et retourne sa valeur.19

source: Over the course of this book, we will present a sequence of increasingly elaborate models of how interpreters work, culminating with a complete implementation of an interpreter and compiler in chapter 5.
fr_fr: Au cours de cet ouvrage, nous présenterons une suite de modèles de fonctionnement de l'interpréteur de complexité croissante qui culminera avec l'implémentation complète d'un interpréteur et d'un compilateur au chapitre 5.

source: Prefix notation has several advantages, however.
fr_fr: La notation inversée a cependant plusieurs avantages.

source: Structure and Interpretation
fr_fr: Structure et interprétation

source: Structure and Interpretation of Computer Programs
fr_fr: Structure et interprétation des programmes informatiques

source: Such exceptions to the general evaluation rule are called special forms.
fr_fr: Ce genre d'exceptions à la règle générale d'évaluation sont appelées des formes spéciales.

source: That is, the interpreter evaluates the elements of the combination and applies the procedure (which is the value of the operator of the combination) to the arguments (which are the values of the operands of the combination).
fr_fr: L'interpréteur évalue les éléments de la combinaison et applique la procédure (qui est la valeur de l'opérateur de la combinaison) aux arguments (qui sont les valeurs des opérandes de la combinaison).

source: The <name> is a symbol to be associated with the procedure definition in the environment.13 The <formal parameters> are the names used within the body of the procedure to refer to the corresponding arguments of the procedure.
fr_fr: Le <nom> est un symbole à associer à la définition de procédure dans l'environnement.13 Les <paramètres formels> sont les noms utilisés dans le corps de la procédure pour faire référence aux arguments correspondants de la procédure.

source: The terminal nodes (that is, nodes with no branches stemming from them) represent either operators or numbers.
fr_fr: Les nœuds terminaux (c'est-à-dire les nœuds dont ne partent aucune branche) représentent soit des opérateurs, soit des nombres.

source: The <body> is an expression that will yield the value of the procedure application when the formal parameters are replaced by the actual arguments to which the procedure is applied.14 The <name> and the <formal parameters> are grouped within parentheses, just as they would be in an actual call to the procedure being defined.
fr_fr: Le <corps> est une expression qui produira la valeur de l'application de la procédure quand les paramètres formels sont remplacés par les arguments actuels sur lesquels la procédure va s'appliquer.14 Le <nom> et les <paramètres formels> sont regroupés entre parenthèses, de la même manière que si la fonction définie était réellement appelée.

source: The value of a combination is obtained by applying the procedure specified by the operator to the arguments that are the values of the operands.
fr_fr: La valeur de la combinaison est obtenue en appliquant la procédure spécifiée par l'opérateur aux arguments qui sont les valeurs des opérandes.

source: The absolute-value procedure abs makes use of the primitive predicates >, <, and =.18 These take two numbers as arguments and test whether the first number is, respectively, greater than, less than, or equal to the second number, returning true or false accordingly.
fr_fr: La procédure valeur-absolue abs utilise les propositions primitives >, < et =.18 Ces propositions requièrent deux nombres comme arguments et vérifient si le premier nombre est respectivement supérieur, inférieur ou égal au second nombre, retournant vrai ou faux selon les cas.

source: The convention of placing the operator to the left of the operands is known as prefix notation, and it may be somewhat confusing at first because it departs significantly from the customary mathematical convention.
fr_fr: La convention qui consiste à placer l'opérateur à la gauche des opérandes est connue sous le nom de notation inversée et peut prêter à confusion au début car elle est très différente des conventions utilisées d'habitude en mathématiques.

source: The expressive power of the class of procedures that we can define at this point is very limited, because we have no way to make tests and to perform different operations depending on the result of a test.
fr_fr: Le pouvoir expressif de la classe de procédures que nous avons pu définir jusqu'ici est très limité car nous n'avons aucun moyen d'effectuer des tests et des opérations en fonction du résultat des tests.

source: The first expression in each pair is a predicate -- that is, an expression whose value is interpreted as either true or false.17
fr_fr: La première expression dans chaque paire est une proposition -- c'est-à-dire une expression qui est soit vraie soit fausse.17

source: The general form of a conditional expression is
fr_fr: La forme générale d'une expression conditionnelle est

source: The general form of a procedure definition is
fr_fr: La forme générale d'une définition de procédure est

source: The general form of an if expression is
fr_fr: La forme générale d'une expression if est

source: The interpreter evaluates the expressions <e> one at a time, in left-to-right order.
fr_fr: L'interprète évalue les expressions <e> une par une, de gauche à droite.

source: The interpreter makes this step-by-step program construction particularly convenient because name-object associations can be created incrementally in successive interactions.
fr_fr: L'interpréteur rend cette construction de programme par étape particulièrement pratique car les associations noms-objets peuvent être créées de manière incrémentées en interactions successives.

source: The language also serves as a framework within which we organize our ideas about processes.
fr_fr: Le langage est également un cadre dans lequel nous organisons nos idées et processus.

source: The leftmost element in the list is called the operator, and the other elements are called operands.
fr_fr: L'élément le plus à gauche de la liste est appelé l'opérateur et les autres éléments sont appelés les opérandes.

source: The predicate <p1> is evaluated first.
fr_fr: La proposition <p1> est évaluée en premier.

source: The procedure represents the operation of multiplying something by itself.
fr_fr: La procédure représente l'opération qui consiste à multiplier une chose par elle même.

source: The process we have just described is called the substitution model for procedure application.
fr_fr: Le processus que nous venons de décrire est appelé le modèle de substitution pour l'application de procédures.

source: The purpose of the substitution is to help us think about procedure application, not to provide a description of how the interpreter really works.
fr_fr: L'objectif de la substitution est de nous aider à penser à l'application de la procédure et non pas de nous fournir une description du fonctionnement réel de l'interpréteur.

source: The resulting indentations display clearly the structure of the expression.6
fr_fr: Les indentations résultantes affichent clairement la structure de l'expression.6

source: The substitution model is no exception.
fr_fr: Le modèle de substitution ne fait pas exception.

source: The substitution model is only the first of these models -- a way to get started thinking formally about the evaluation process.
fr_fr: Le modèle de substitution est seulement le premier de ces modèles, une manière de commencer à penser de manière formelle au processus d'évaluation.

source: The thing to be multiplied is given a local name, x, which plays the same role that a pronoun plays in natural language.
fr_fr: La chose à multiplier a un nom local, x, qui joue le même rôle qu'un pronom jouerai dans une langue naturelle.

source: The three most frequently used are these:
fr_fr: Les trois plus fréquents sont :

source: The value of a not expression is true when the expression <e> evaluates to false, and false otherwise.
fr_fr: La valeur d'une expression not est vraie quand l'expression <e> est fausse, et fausse autrement.

source: The various kinds of expressions (each with its associated evaluation rule) constitute the syntax of the programming language.
fr_fr: Les différents types d'expressions (chacun associé à une règle d'évaluation) constituent la syntaxe du langage de programmation.

source: The word predicate is used for procedures that return true or false, as well as for expressions that evaluate to true or false.
fr_fr: Le mot proposition est utilisé pour des procédures qui retournent vrai ou faux ainsi que pour des expressions qui s'évaluent à vrai ou faux.

source: Then he evaluates the expression
fr_fr: Puis évalue l'expression

source: Then we replace the formal parameter a by the argument 5:
fr_fr: Puis remplaçons le paramètre formel a par l'argument 5 :

source: There is no limit (in principle) to the depth of such nesting and to the overall complexity of the expressions that the Lisp interpreter can evaluate.
fr_fr: Il n'y a aucune limite (en principe) à la profondeur de ce genre d'emboitement ou à la complexité globale de l'expression que l'interpréteur Lisp peut évaluer.

source: These values are substituted for the formal parameters x and y in the body of sum-of-squares, reducing the expression to
fr_fr: Ces values sont substituées aux paramètres formels x et y dans le corps de somme-de-carrés pour réduire l'expression à

source: This alternative ``fully expand and then reduce'' evaluation method is known as normal-order evaluation, in contrast to the ``evaluate the arguments and then apply'' method that the interpreter actually uses, which is called applicative-order evaluation.
fr_fr: Cette méthode d'évaluation où l'on « développe totalement avant de réduire » est connue sous le nome de évaluation en ordre normal, en opposition à la méthode « évalue les arguments et applique ensuite » utilisée en fait par l'interpréteur, qui est appelée évaluation dans l'ordre d'application.

source: This causes the cond to return as its value the value of the corresponding <e> whenever all previous clauses have been bypassed.
fr_fr: Ceci force le cond à retourner en tant que sa valeur, la valeur du <e> correspondant quand toutes les clauses précédentes ont été ignorées.

source: This construct is called a case analysis, and there is a special form in Lisp for notating such a case analysis.
fr_fr: Ce genre de construction est appelé une analyse de cas et il existe une forme spéciale en Lisp pour les noter.

source: This feature encourages the incremental development and testing of programs and is largely responsible for the fact that a Lisp program usually consists of a large number of relatively simple procedures.
fr_fr: Cette fonction encourage le développement et les tests incrémentiels de programmes et est en grande partie responsable du fait qu'un programme en Lisp consiste en général d'un grand nombre de procédures relativement simples.

source: This gives the same answer as our previous evaluation model, but the process is different.
fr_fr: La réponse est la même que le modèle précédent mais le processus est différent.

source: This is not the only way to perform evaluation.
fr_fr: Ceci n'est pas la seule façon de procéder à une évaluation.

source: This memory is called the environment (more precisely the global environment, since we will see later that a computation may involve a number of different environments).9
fr_fr: Cette mémoire est appelée l'environnement (ou plus précisément l'environnement global, puisque nous verrons plus tard qu'un calcul peut impliquer un certain nombre d'environnements différents).9

source: This mode of operation is often expressed by saying that the interpreter runs in a read-eval-print loop.
fr_fr: Ce mode de fonctionnement est souvent décrit en disant que l'interpréteur fonctionne dans en boucle lecture-évaluation-affichage.

source: This process continues until a predicate is found whose value is true, in which case the interpreter returns the value of the corresponding consequent expression <e> of the clause as the value of the conditional expression.
fr_fr: Ce processus se poursuit jusqu'à ce que l'interpréteur trouve une proposition vraie. Il retourne alors la valeur de l'expression conséquence <e> correspondante dans la clause en tant que valeur de l'expression conditionnelle.

source: This uses the special form if, a restricted type of conditional that can be used when there are precisely two cases in the case analysis.
fr_fr: On utilise la forme spéciale if, un type restreint de conditionnel qui peut être utilisé quand il y a précisément deux cas dans l'analyse de cas.

source: Thus the problem reduces to the evaluation of a combination with two operands and an operator sum-of-squares.
fr_fr: Le problème se réduit ainsi à l'évaluation d'une combinaison de deux opérandes et de l'opérateur somme-de-carrés.

source: Thus, any powerful programming language should be able to describe primitive data and primitive procedures and should have methods for combining and abstracting procedures and data.
fr_fr: C'est la raison pour laquelle n'importe quel langage de programmation puissant devrait être capable de décrire des données et des procédures primitives, ainsi que de proposer des méthodes pour combiner et abstraire des données et des procédures.

source: Thus, the evaluation rule is recursive in nature; that is, it includes, as one of its steps, the need to invoke the rule itself.10
fr_fr: De ce fait, la règle d'évaluation est récursive par nature ; c'est-à-dire qu'elle inclut dans l'une de ses étapes le besoin d'invoquer la règle elle-même.10

source: Thus, when we describe a language, we should pay particular attention to the means that the language provides for combining simple ideas to form more complex ideas.
fr_fr: Quand nous décrivons un langage, une attention particulière doit être donnée aux moyens que le langage fourni pour combiner des idées simples en idées plus complexes.

source: To apply a compound procedure to arguments, evaluate the body of the procedure with each formal parameter replaced by the corresponding argument.
fr_fr: Pour appliquer une procédure composée à des arguments, évaluer le corps de la procédure avec chaque paramètre formel remplacé par l'argument correspondant.

source: To evaluate a combination whose operator names a compound procedure, the interpreter follows much the same process as for combinations whose operators name primitive procedures, which we described in section 1.1.3.
fr_fr: Pour évaluer une combinaison dont l'opérateur est le nom d'une procédure composée, l'interpréteur suit en grande partie le même processus que pour les combinaisons dont les opérateurs sont le nom de procédures primitives, décrit en section 1.1.3.

source: To evaluate a combination, do the following:
fr_fr: Pour évaluer une combinaison, suivre les étapes suivantes :

source: To evaluate an if expression, the interpreter starts by evaluating the <predicate> part of the expression.
fr_fr: L'évaluation d'une expression if commence par l'évaluation de la partie <proposition> de l'expression.

source: To illustrate this process, let's evaluate the combination
fr_fr: Pour illustrer ce processus, évaluons la combinaison

source: To square something, multiply it by itself.
fr_fr: Pour faire le carré de x, multiplier x par lui-même.

source: Typical interpreters do not evaluate procedure applications by manipulating the text of a procedure to substitute values for the formal parameters.
fr_fr: Les interpréteurs n'évaluent pas les applications de procédures en manipulant le texte de la procédure pour substituer les valeurs aux paramètres formels.

source: Typing
fr_fr: Saisir

source: Use this observation to describe the behavior of the following procedure:
fr_fr: Utiliser cette observation pour décrire le comportement de la procédure suivante :

source: Viewing evaluation in terms of the tree, we can imagine that the values of the operands percolate upward, starting from the terminal nodes and then combining at higher and higher levels.
fr_fr: La visualisation de l'évaluation sous la forme d'un arbre permet d'imaginer que les valeurs des opérandes remontent vers le haut, en partant des nœuds terminaux et en se combinant à des niveaux de plus en plus élevés.

source: We begin by examining how to express the idea of ``squaring.'' We might say, ``To square something, multiply it by itself.'' This is expressed in our language as
fr_fr: Commençons par voir comment exprimer l'idée de « mettre au carré ». On peut dire, « Pour mettre quelque chose au carré, il faut multiplier cette chose par elle-même ». Dans notre langage ceci est exprimé de cette manière

source: We begin by retrieving the body of f:
fr_fr: Commençons par retrouver le corps de f :

source: We can also use square as a building block in defining other procedures.
fr_fr: Nous pouvons également utiliser carré comme bloc pour définir d'autres procédures.

source: We can assume that the mechanism for applying primitive procedures to arguments is built into the interpreter.
fr_fr: Nous pouvons considérer que le mécanisme pour appliquer des procédures primitives aux arguments est construit dans l'interpréteur.
